Repository: dnuno10/pseudoplay
Catalog: lib/l10n/app_*.arb
Languages: es

# splashLoadingMessage
source: Booting retro core…
es: Cargando núcleo retro…

# splashInitPreferences
source: Loading your preferences
es: Inicializando tus preferencias

# splashTapToStart
source: PRESS START
es: PRESIONA START

# splashProgressLabel
source: Loading
es: Cargando

# nameDialogTitle
source: Choose your codename
es: Elige tu nombre de juego

# nameDialogMessage
source: Enter the name that will appear on the consoles.
es: Ingresa el nombre que aparecerá en las consolas retro.

# nameDialogPlaceholder
source: Player name
es: Nombre del jugador

# nameDialogConfirm
source: Save
es: Guardar

# nameDialogCancel
source: Cancel
es: Cancelar

# nameRequiredError
source: Please enter a name to continue.
es: Necesitas un nombre para continuar.

# menuFlashcardsTitle
source: Pseudocode flashcards
es: Flashcards de pseudocódigo

# menuFlashcardsDescription
source: Flip retro cards to memorize every reserved word between INICIO and FIN.
es: Voltea tarjetas retro y memoriza cada palabra reservada entre INICIO y FIN.

# menuFlashcardsCTA
source: Play
es: Jugar

# menuPlayButton
source: Play
es: Jugar

# menuEditButton
source: Edit
es: Editar

# menuExecuteTitle
source: Run pseudocode
es: Ejecutar pseudocódigo

# menuExecuteSubtitle
source: Write and execute algorithms step by step without friction.
es: Escribe y ejecuta algoritmos paso a paso sin fricción.

# menuBlocksTitle
source: Blocks mode
es: Modo por bloques

# menuBlocksSubtitle
source: Drag-and-drop retro blocks to build algorithms visually.
es: Arrastra bloques retro para construir algoritmos visualmente.

# menuPlaytimeLabel
source: Time played
es: Tiempo jugado

# menuAlgorithmsLabel
source: Algorithms executed
es: Algoritmos ejecutados

# settingsTitle
source: Settings
es: Configuración

# settingsLanguageLabel
source: Language
es: Idioma

# settingsLanguageEnglish
source: English
es: Inglés

# settingsLanguageSpanish
source: Spanish
es: Español

# settingsLanguageDescription
source: Switch the entire retro interface to your preferred language.
es: Cambia todo el sistema retro al idioma que prefieras.

# settingsRenameButton
source: Change player name
es: Cambiar nombre del jugador

# settingsClearCacheButton
source: Clear cache and restart
es: Borrar caché y reiniciar

# settingsClearCacheConfirm
source: Are you sure? All local progress, name, and preferences will be erased.
es: ¿Seguro? Se borrarán progreso, nombre y preferencias locales.

# settingsPrivacyTitle
source: Privacy
es: Privacidad

# settingsPrivacyBody
source: We only store your local play stats on this device. Nothing is uploaded.
es: Solo guardamos tus estadísticas locales en este dispositivo. Nada se envía a internet.

# settingsTermsTitle
source: Terms and Conditions
es: Términos y condiciones

# settingsTermsBody
source: Use PseudoPlay responsibly. The retro vibes are provided as-is, without warranties.
es: Usa PseudoPlay con responsabilidad. Las vibras retro se ofrecen tal cual, sin garantías.

# privacyDialogClose
source: Close
es: Cerrar

# termsViewTitle
source: Terms and Conditions
es: Términos y condiciones

# termsViewIntroTitle
source: Using PseudoPlay
es: Uso de PseudoPlay

# termsViewIntroBody
source: PseudoPlay is a learning tool for experimenting with algorithms. By continuing you agree to use it respectfully and only for educational purposes.
es: PseudoPlay es una herramienta de aprendizaje para experimentar con algoritmos. Al continuar aceptas usarla con respeto y solo con fines educativos.

# termsViewContentTitle
source: Content ownership
es: Propiedad del contenido

# termsViewContentBody
source: All retro assets, copy, and visual style remain property of the PseudoPlay team. Please do not redistribute without permission.
es: Todos los assets retro, textos y estilo visual pertenecen al equipo de PseudoPlay. No los redistribuyas sin permiso.

# termsViewWarrantyTitle
source: Warranty and liability
es: Garantía y responsabilidad

# termsViewWarrantyBody
source: PseudoPlay is provided as-is without guarantees. We are not liable for data loss, interruptions, or damages caused by misuse.
es: PseudoPlay se ofrece tal cual, sin garantías. No somos responsables por pérdida de datos, interrupciones o daños causados por un mal uso.

# termsViewUpdatesTitle
source: Updates
es: Actualizaciones

# termsViewUpdatesBody
source: We may update these terms as new builds ship. We'll highlight meaningful changes within the app whenever possible.
es: Estos términos pueden cambiar cuando lancemos nuevas versiones. Avisaremos dentro de la app cuando haya cambios importantes.

# privacyViewTitle
source: Privacy Policy
es: Política de privacidad

# privacyViewIntroTitle
source: What we store
es: Qué guardamos

# privacyViewIntroBody
source: PseudoPlay stores your player name, execution stats, and preferences locally on your device so you can keep playing offline.
es: PseudoPlay guarda tu nombre de jugador, estadísticas de ejecución y preferencias únicamente en tu dispositivo para que puedas seguir jugando sin conexión.

# privacyViewDataTitle
source: No cloud sync
es: Sin sincronización en la nube

# privacyViewDataBody
source: We never send your information to external servers. Clearing the cache deletes everything permanently.
es: Nunca enviamos tu información a servidores externos. Al limpiar la caché se elimina todo de forma permanente.

# privacyViewControlTitle
source: Your control
es: Tu control

# privacyViewControlBody
source: You can reset all saved data anytime from the danger zone inside settings.
es: Puedes borrar los datos cuando quieras desde la zona de peligro en ajustes.

# privacyViewContactTitle
source: Questions?
es: ¿Dudas?

# privacyViewContactBody
source: Reach out to the PseudoPlay team if you have doubts about this policy or need help managing your data.
es: Escríbenos si necesitas más detalles sobre esta política o ayuda para gestionar tus datos.

# statsAlgorithmsValue
source: {count} algorithms
es: {count} algoritmos

# languageDialogTitle
source: Select language
es: Selecciona idioma

# snackbarNameUpdated
source: Player name updated!
es: ¡Nombre actualizado!

# snackbarCacheCleared
source: Cache cleared. Restarting…
es: Caché borrada. Reiniciando…

# snackbarLanguageUpdated
source: Language updated
es: Idioma actualizado

# splashMissingNameTitle
source: We need your player name to continue.
es: Necesitamos tu nombre de jugador para continuar.

# modeTimeUnavailable
source: No playtime recorded yet
es: Aún no hay tiempo registrado

# settingsOpenPrivacy
source: Read privacy
es: Leer privacidad

# settingsOpenTerms
source: Read terms
es: Leer términos

# flashcardsIntroDescription
source: Explore each card to learn how to write common operations between INICIO and FIN. Tap to flip and view the full example.
es: Explora cada tarjeta para saber cómo escribir las operaciones más comunes entre INICIO y FIN. Toca para voltear y ver el ejemplo completo.

# genericBack
source: Back
es: Regresar
